#include <iostream>

using namespace std;


int main()
{
	int n = 0;
	int a = 0;
	int b = 0;
	int c = 0;

	cin » n;

	a = n % 100;
	b = n & 10 - a * 100;
	c = n - a * 100 - b * 10;

	if (a * 100 = 100)
	{
		cout « "сто ";
	}
	if (a * 100 = 200)
	{
		cout « "двести ";
	}
	if (a * 100 = 300)
	{
		cout « "триста ";
	}
	if (a * 100 = 400)
	{
		cout « "четыреста ";
	}
	if (a * 100 = 500)
	{
		cout « "пятьсот ";
	}
	if (a * 100 = 600)
	{
		cout « "шестьсот ";
	}
	if (a * 100 = 700)
	{
		cout « "семьсот ";
	}
	if (a * 100 = 800)
	{
		cout « "восемьсот ";
	}
	if (a * 100 = 900)
	{
		cout « "девятьсот";
	}

	if (b == 1 || c == 0)
	{
		cout « "десять бананов";
		break;
	}
	if (b == 1 || c == 1)
	{
		cout « "одиннадцать бананов";
		break;
	}
	if (b == 1 || c == 2)
	{
		cout « "двенадцать бананов";
		break;
	}
	if (b == 1 || c == 3)
	{
		cout « "тринадцать бананов";
		break;
	}
	if (b == 1 || c == 4)
	{
		cout « "четырнадцать бананов";
		break;
	}
	if (b == 1 || c == 5)
	{
		cout « "пятнадцать бананов";
		break;
	}
	if (b == 1 || c == 6)
	{
		cout « "шестнадцать бананов";
		break;
	}
	if (b == 1 || c == 7)
	{
		cout « "семнадцать бананов";
		break;
	}
	if (b == 1 || c == 8)
	{
		cout « "восемьнадцать бананов";
		break;
	}
	if (b == 1 || c == 9)
	{
		cout « "девятнадцать бананов";
		break;
	}
	if (b == 2)
	{
		cout « "двадцать";
	}
	if (b == 3)
	{
		cout « "тридцать";
	}
	if (b == 4)
	{
		cout « "сорок";
	}
	if (b == 5)
	{
		cout « "пятьдесят";
	}
	if (b == 6)
	{
		cout « "шестьдесять";
	}
	if (b == 7)
	{
		cout « "семьдесят";
	}
	if (b == 8)
	{
		cout « "восемьдесять";
	}
	if (b == 9)
	{
		cout « "девяносто";
	}
	if (c == 1)
	{
		cout « "один банан";
	}
	if (c == 2)
	{
		cout « "два бананан";
	}
	if (c == 3)
	{
		cout « "три банана";
	}
	if (c == 4)
	{
		cout « "четыре банана";
	}
	if (c == 5)
	{
		cout « "пять бананов";
	}
	if (c == 6)
	{
		cout « "шесть бананов";
	}
	if (c == 7)
	{
		cout « "семь бананов";
	}
	if (c == 8)
	{
		cout « "восемь дананов";
	}
	if (c == 9)
	{
		cout « "девять бананов";
	}
	if (c == 0)
	{
		cout « "бананов";
	}
}